platformio/platform-atmelavr/misc/svd/atmega64.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JTAG</name>
      <description>JTAG Interface</description>
      <baseAddress>0x42</baseAddress>
      <registers>
        <register>
          <name>MCUCSR</name>
          <description>MCU Control And Status Register</description>
          <addressOffset>0x12</addressOffset>
          <fields>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR</name>
          <description>On-Chip Debug Related Register in I/O Memory</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OCDR</name>
              <description>On-Chip Debug Register Bits</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Lockbits</description>
      <baseAddress>0x0</baseAddress>
      <registers>
        <register>
          <name>LOCKBIT</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LB</name>
              <description>Memory Lock</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROG_VER_DISABLED</name>
                  <description>Further programming and verification disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_DISABLED</name>
                  <description>Further programming disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No memory lock features enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB0</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Application Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Application Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Application Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Application Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB1</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Boot Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Boot Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Boot Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Boot Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MISC</name>
      <description>Other Registers</description>
      <baseAddress>0x40</baseAddress>
      <registers>
        <register>
          <name>SFIOR</name>
          <description>Special Function IO Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PSR321</name>
              <description>Prescaler Reset Timer/Counter3, Timer/Counter2, and Timer/Counter1</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PSR0</name>
              <description>Prescaler Reset Timer/Counter0</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull Up Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACME</name>
              <description>Analog Comparator Multiplexer Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
