platformio/platform-atmelavr/misc/svd/atmega64.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTE</name>
      <description>I/O Port</description>
      <baseAddress>0x21</baseAddress>
      <registers>
        <register>
          <name>DDRE</name>
          <description>Data Direction Register, Port E</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PE0</name>
              <description>Pin E0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PE1</name>
              <description>Pin E1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PE2</name>
              <description>Pin E2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PE3</name>
              <description>Pin E3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PE4</name>
              <description>Pin E4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PE5</name>
              <description>Pin E5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PE6</name>
              <description>Pin E6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PE7</name>
              <description>Pin E7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINE</name>
          <description>Input Pins, Port E</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PE0</name>
              <description>Pin E0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PE1</name>
              <description>Pin E1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PE2</name>
              <description>Pin E2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PE3</name>
              <description>Pin E3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PE4</name>
              <description>Pin E4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PE5</name>
              <description>Pin E5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PE6</name>
              <description>Pin E6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PE7</name>
              <description>Pin E7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTE</name>
          <description>Data Register, Port E</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PE0</name>
              <description>Pin E0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PE1</name>
              <description>Pin E1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PE2</name>
              <description>Pin E2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PE3</name>
              <description>Pin E3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PE4</name>
              <description>Pin E4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PE5</name>
              <description>Pin E5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PE6</name>
              <description>Pin E6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PE7</name>
              <description>Pin E7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTF</name>
      <description>I/O Port</description>
      <baseAddress>0x20</baseAddress>
      <registers>
        <register>
          <name>DDRF</name>
          <description>Data Direction Register, Port F</description>
          <addressOffset>0x41</addressOffset>
          <fields>
            <field>
              <name>PF0</name>
              <description>Pin F0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PF1</name>
              <description>Pin F1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PF2</name>
              <description>Pin F2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PF3</name>
              <description>Pin F3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PF4</name>
              <description>Pin F4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PF5</name>
              <description>Pin F5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PF6</name>
              <description>Pin F6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PF7</name>
              <description>Pin F7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINF</name>
          <description>Input Pins, Port F</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PF0</name>
              <description>Pin F0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PF1</name>
              <description>Pin F1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PF2</name>
              <description>Pin F2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PF3</name>
              <description>Pin F3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PF4</name>
              <description>Pin F4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PF5</name>
              <description>Pin F5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PF6</name>
              <description>Pin F6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PF7</name>
              <description>Pin F7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTF</name>
          <description>Data Register, Port F</description>
          <addressOffset>0x42</addressOffset>
          <fields>
            <field>
              <name>PF0</name>
              <description>Pin F0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PF1</name>
              <description>Pin F1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PF2</name>
              <description>Pin F2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PF3</name>
              <description>Pin F3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PF4</name>
              <description>Pin F4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PF5</name>
              <description>Pin F5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PF6</name>
              <description>Pin F6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PF7</name>
              <description>Pin F7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
