platformio/platform-atmelavr/misc/svd/atmega64.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTG</name>
      <description>I/O Port</description>
      <baseAddress>0x63</baseAddress>
      <registers>
        <register>
          <name>DDRG</name>
          <description>Data Direction Register, Port G</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PG0</name>
              <description>Pin G0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PG1</name>
              <description>Pin G1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PG2</name>
              <description>Pin G2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PG3</name>
              <description>Pin G3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PG4</name>
              <description>Pin G4</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PING</name>
          <description>Input Pins, Port G</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PG0</name>
              <description>Pin G0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PG1</name>
              <description>Pin G1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PG2</name>
              <description>Pin G2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PG3</name>
              <description>Pin G3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PG4</name>
              <description>Pin G4</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTG</name>
          <description>Data Register, Port G</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PG0</name>
              <description>Pin G0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PG1</name>
              <description>Pin G1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PG2</name>
              <description>Pin G2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PG3</name>
              <description>Pin G3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PG4</name>
              <description>Pin G4</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x2D</baseAddress>
      <registers>
        <register>
          <name>SPCR</name>
          <description>SPI Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SPR</name>
              <description>SPI Clock Rate Selects</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>SPR</name><usage>read-write</usage><enumeratedValue><name>FOSC_4_2</name><description>Fosc/4 if SPI2X == 0 else Fosc/2</description><value>0</value></enumeratedValue><enumeratedValue><name>FOSC_16_8</name><description>Fosc/16 if SPI2X == 0 else Fosc/8</description><value>1</value></enumeratedValue><enumeratedValue><name>FOSC_64_32</name><description>Fosc/64 if SPI2X == 0 else Fosc/32</description><value>2</value></enumeratedValue><enumeratedValue><name>FOSC_128_64</name><description>Fosc/128 if SPI2X == 0 else Fosc/64</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master/Slave Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DORD</name>
              <description>Data Order</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPE</name>
              <description>SPI Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SPIE</name>
              <description>SPI Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDR</name>
          <description>SPI Data Register</description>
          <addressOffset>0x2</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPSR</name>
          <description>SPI Status Register</description>
          <addressOffset>0x1</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI2X</name>
              <description>Double SPI Speed Bit</description>
              <bitRange>[0:0]</bitRange>
            <access>read-write</access></field>
            <field>
              <name>WCOL</name>
              <description>Write Collision Flag</description>
              <bitRange>[6:6]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>SPIF</name>
              <description>SPI Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
            <access>read-only</access></field>
          </fields>
        </register>
