platformio/platform-atmelavr/misc/svd/atmega64.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC2</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x43</baseAddress>
      <registers>
        <register>
          <name>OCR2</name>
          <description>Output Compare Register</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR2</name>
          <description>Timer/Counter Control Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>CS2</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Running, ExtClk Tx Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Running, ExtClk Tx Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM21</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>COM2</name>
              <description>Compare Match Output Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WGM20</name>
              <description>Wafeform Generation Mode</description>
              <bitRange>[6:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>CTC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOC2</name>
              <description>Force Output Compare</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT2</name>
          <description>Timer/Counter Register</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x13</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TOV2</name>
              <description>Timer/Counter2 Overflow Flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OCF2</name>
              <description>Output Compare Flag 2</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>TOIE2</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OCIE2</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TC3</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x40</baseAddress>
      <registers>
        <register>
          <name>ETIFR</name>
          <description>Extended Timer/Counter Interrupt Flag register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>OCF3C</name>
              <description>Timer/Counter3 Output Compare C Match Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOV3</name>
              <description>Timer/Counter3 Overflow Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCF3B</name>
              <description>Output Compare Flag 3B</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCF3A</name>
              <description>Output Compare Flag 3A</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICF3</name>
              <description>Input Capture Flag 3</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETIMSK</name>
          <description>Extended Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x3D</addressOffset>
          <fields>
            <field>
              <name>OCIE3C</name>
              <description>Timer/Counter3, Output Compare Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOIE3</name>
              <description>Timer/Counter3 Overflow Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCIE3B</name>
              <description>Timer/Counter3 Output CompareB Match Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCIE3A</name>
              <description>Timer/Counter3 Output CompareA Match Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TICIE3</name>
              <description>Timer/Counter3 Input Capture Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR3</name>
          <description>Timer/Counter3 Input Capture Register  Bytes</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3A</name>
          <description>Timer/Counter3 Output Compare Register A  Bytes</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3B</name>
          <description>Timer/Counter3 Output Compare Register B  Bytes</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3C</name>
          <description>Timer/Counter3 Output compare Register C  Bytes</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SFIOR</name>
          <description>Special Function IO Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PSR321</name>
              <description>Prescaler Reset, T/C3, T/C2, T/C1</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3A</name>
          <description>Timer/Counter3 Control Register A</description>
          <addressOffset>0x4B</addressOffset>
          <fields>
            <field>
              <name>WGM3</name>
              <description>Waveform Generation Mode Bits</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM3C</name>
              <description>Compare Output Mode 3C, bits</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM3B</name>
              <description>Compare Output Mode 3B, bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM3A</name>
              <description>Compare Output Mode 3A, bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3B</name>
          <description>Timer/Counter3 Control Register B</description>
          <addressOffset>0x4A</addressOffset>
          <fields>
            <field>
              <name>CS3</name>
              <description>Clock Select3 bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Running, ExtClk Tx Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Running, ExtClk Tx Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM3</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[4:3]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ICES3</name>
              <description>Input Capture 3 Edge Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ICNC3</name>
              <description>Input Capture 3  Noise Canceler</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3C</name>
          <description>Timer/Counter3 Control Register C</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>FOC3C</name>
              <description>Force Output Compare for channel C</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FOC3B</name>
              <description>Force Output Compare for channel B</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FOC3A</name>
              <description>Force Output Compare for channel A</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT3</name>
          <description>Timer/Counter3  Bytes</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
