platformio/platform-atmelavr/misc/svd/atmega64.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TWI</name>
      <description>Two Wire Serial Interface</description>
      <baseAddress>0x70</baseAddress>
      <registers>
        <register>
          <name>TWAR</name>
          <description>TWI (Slave) Address register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>TWGCE</name>
              <description>TWI General Call Recognition Enable Bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TWA</name>
              <description>TWI (Slave) Address register Bits</description>
              <bitRange>[7:1]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWBR</name>
          <description>TWI Bit Rate register</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TWCR</name>
          <description>TWI Control Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TWIE</name>
              <description>TWI Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TWEN</name>
              <description>TWI Enable Bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TWWC</name>
              <description>TWI Write Collition Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TWSTO</name>
              <description>TWI Stop Condition Bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TWSTA</name>
              <description>TWI Start Condition Bit</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TWEA</name>
              <description>TWI Enable Acknowledge Bit</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TWINT</name>
              <description>TWI Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TWDR</name>
          <description>TWI Data register</description>
          <addressOffset>0x3</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TWSR</name>
          <description>TWI Status Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>TWPS</name>
              <description>TWI Prescaler</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWS</name>
              <description>TWI Status</description>
              <bitRange>[7:3]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USART0</name>
      <description>USART</description>
      <baseAddress>0x29</baseAddress>
      <registers>
        <register>
          <name>UBRR0H</name>
          <description>USART Baud Rate Register Hight Byte</description>
          <addressOffset>0x67</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UBRR0L</name>
          <description>USART Baud Rate Register Low Byte</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UCSR0A</name>
          <description>USART Control and Status Register A</description>
          <addressOffset>0x2</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPCM0</name>
              <description>Multi-processor Communication Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2X0</name>
              <description>Double the USART transmission speed</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPE0</name>
              <description>Parity Error</description>
              <bitRange>[2:2]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>DOR0</name>
              <description>Data overRun</description>
              <bitRange>[3:3]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>FE0</name>
              <description>Framing Error</description>
              <bitRange>[4:4]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UDRE0</name>
              <description>USART Data Register Empty</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>TXC0</name>
              <description>USART Transmit Complete</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXC0</name>
              <description>USART Receive Complete</description>
              <bitRange>[7:7]</bitRange>
            <access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>UCSR0B</name>
          <description>USART Control and Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>TXB80</name>
              <description>Transmit Data Bit 8</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXB80</name>
              <description>Receive Data Bit 8</description>
              <bitRange>[1:1]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UCSZ02</name>
              <description>Character Size</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXEN0</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXEN0</name>
              <description>Receiver Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UDRIE0</name>
              <description>USART Data register Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXCIE0</name>
              <description>TX Complete Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXCIE0</name>
              <description>RX Complete Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR0C</name>
          <description>USART Control and Status Register C</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>UCPOL0</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
            <enumeratedValues><name>UCPOL0</name><usage>read-write</usage><enumeratedValue><name>RISING_EDGE</name><description>Transmit on Rising XCKn Edge, Receive on Falling XCKn Edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FALLING_EDGE</name><description>Transmit on Falling XCKn Edge, Receive on Rising XCKn Edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UCSZ0</name>
              <description>Character Size</description>
              <bitRange>[2:1]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>UCSZ0</name><usage>read-write</usage><enumeratedValue><name>CHR5</name><description>Character Size: 5 bit</description><value>0</value></enumeratedValue><enumeratedValue><name>CHR6</name><description>Character Size: 6 bit</description><value>1</value></enumeratedValue><enumeratedValue><name>CHR7</name><description>Character Size: 7 bit</description><value>2</value></enumeratedValue><enumeratedValue><name>CHR8</name><description>Character Size: 8 bit</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USBS0</name>
              <description>Stop Bit Select</description>
              <bitRange>[3:3]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>USBS0</name><usage>read-write</usage><enumeratedValue><name>STOP1</name><description>1-bit</description><value>0</value></enumeratedValue><enumeratedValue><name>STOP2</name><description>2-bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPM0</name>
              <description>Parity Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UPM0</name><usage>read-write</usage><enumeratedValue><name>DISABLED</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>PARITY_EVEN</name><description>Enabled, Even Parity</description><value>2</value></enumeratedValue><enumeratedValue><name>PARITY_ODD</name><description>Enabled, Odd Parity</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UMSEL0</name>
              <description>USART Mode Select</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UMSEL0</name><usage>read-write</usage><enumeratedValue><name>USART_ASYNC</name><description>Asynchronous USART</description><value>0</value></enumeratedValue><enumeratedValue><name>USART_SYNC</name><description>Synchronous USART</description><value>1</value></enumeratedValue><enumeratedValue><name>SPI_MASTER</name><description>Master SPI (MSPIM)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR0</name>
          <description>USART I/O Data Register</description>
          <addressOffset>0x3</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
